Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Browsing history cleared
am: የአሰሳ ታሪክ ጸድቷል

source: Browsing history cleared! 🎉
am: የአሰሳ ታሪክ ጸድቷል! 🎉

source: By continuing, you agree to the %1$s
am: በመቀጠል፣ በ%1$s ተስማምተዋል

source: By default, %1$s attempts to connect using HTTPS for increased security. To change this setting or to learn more, go to Settings > Privacy & Security > Security.
am: በነባሪነት %1$s ለበለጠ ደህንነት HTTPS በመጠቀም ለመገናኘት ይሞክራል። ይህን ቅንብር ለመለወጥ ወይም የበለጠ ለማወቅ ወደ ቅንብሮች > ግላዊነት እና ደህንነት > ደህንነት ይሂዱ።

source: Choose search engine
am: የፍለጋ ፍርግም ይምረጡ

source: Clear input
am: ግቤት አጽዳ

source: Close other tabs
am: ሌሎች ትሮችን ዝጋ

source: Close popup
am: ብቅ ባይን ዝጋ

source: Close Tab
am: ትርን ዝጋ

source: Completed
am: የተጠናቀቀ

source: Confirm Using Your Fingerprint
am: የጣት አሻራዎን በመጠቀም ያረጋግጡ

source: Content Blocking
am: የይዘት እገዳ

source: Cookies and Site Data
am: ኩኪዎች እና የድረ-ገፅ ውሂብ

source: Data Choices
am: የውሂብ ምርጫዎች

source: Data Collection & Use
am: የውሂብ ስብሰባ እና አጠቃቀም

source: Default browser, language
am: ነባሪ አሳሽ፣ ቋንቋ

source: Developer tools
am: የገንቢ መሳሪያዎች

source: Double-check the URL you entered.
am: በድጋሚ አረጋጡ ያስገቡትን URL

source: Download Firefox
am: ፋየርፎክስ አውርድ

source: Embedded on sites to track your visits and to display functionality like share buttons
am: የእርስዎን ጉብኝቶች ለመከታተል እና እንደ የአጋራ አዝራሮች ያሉ ተግባሮችን ለማሳየት በጣቢያዎች ላይ የተካተተ

source: Enable to have %s autocomplete over 450 popular URLs in the address bar.
am: በአድራሻ አሞሌው ውስጥ ከ450 በላይ ታዋቂ ዩአርኤሎችን %s በራስ ሰር እንዲያጠናቅቅ ያንቁ።

source: Enable to have %s autocomplete your favorite URLs.
am: የሚወዷቸውን ዩአርኤሎች %s በራስ ሰር እንዲያጠናቅቅ ያንቁ።

source: Enabling may cause some pages to behave unexpectedly
am: ማስቻል አንዳንድ ገፆችን ያልታሰበ ፀባይ እንዲፈጽሙ ሊያደርጋቸው ይችላል

source: Enter search string
am: የፍለጋ ህብረ ቁምፊ ያስገቡ

source: Erase
am: አጠፉ

source: Erase and Open
am: አጠፉ እና ክፈት

source: Erase and open %1$s
am: አጥፋ እና ክፈት %1$s

source: Erase browsing history?
am: የአሰሳ ታሪክን ይጥፋ?

source: Erase & open
am: አጥፋ እና ከፈት

source: Example: example.com
am: ምሳሌ : ምሳሌ.com

source: Example: example.com/search/?q=%s
am: ለምሳሌ: ለምሳሌ.com /search/?q=%s

source: Example: mozilla.org
am: ምሳሌ: mozilla.org

source: Exit Private Browsing?
am: የግል አሰሳውን ውጣ?

source: Fast. Private. No distractions.
am: ፈጣን። የግል። ትኩረትን የሚከፋፍሉ ነገሮች የሌለው።

source: Find an app that can open link
am: አገናኙን መክፈት የሚችል መተግበሪያ ያግኙ

source: Find in Page
am: በገጽ ውስጥ ያግኙ

source: Finger moved too fast. Try again.
am: ጣትዎ በጣም በፍጥነት ተንቀሳቅሷል። እንደገና ይሞክሩ።

source: Fingerprint icon
am: የጣት አሻራ አዶ

source: Fingerprint not recognized. Try again.
am: የማይታወቅ የጣት አሻራ። እንደገና ይሞክሩ።

source: Firefox cares about your privacy. Learn more in our %1$s
am: Firefox የእርስዎን ግላዊነት ያስባል። በእኛ %1$s ውስጥ የበለጠ ይወቁ

source: Firefox may install and run studies from time to time.
am: ፋየርፎክስ ከጊዜ ወደ ጊዜ ጥናቶችን ሊጭን እና ሊያሄድ ይችላል።

source: Firefox Terms of Use.
am: የFirefox የአጠቃቀም ውል።

source: For sites you add
am: ለሚያክሏቸው ድረ-ገፆች

source: For top sites
am: ለዋና ዋና ድረ-ገፆች

source: Get one-tap access to sites you use most%1$s Menu > Add to Home screen
am: ብዙ ጊዜ የሚጠቀሟቸውን ድረ-ገፆች በቅርብ ለማግኘት%1$s ምናሌ > ወደ መነሻ ገፅ አክል

source: Get search suggestions
am: የፍለጋ ጥቆማዎችን ያግኙ

source: Go back
am: ተመለስ

source: Got ‘em! We stopped this site from spying on you. Tap the shield any time to see what we’re blocking.
am: ይዘናቸዋል! ይህ ድረ-ገፅ እርስዎን እንዳይሰልል አቁመነዋል። የምንከለክለውን ለማየት በማንኛውም ጊዜ መከለያውን ይንኩ።

source: Hide webpages when switching apps and block taking screenshots.
am: መተግበሪያዎች በሚቀይሩበት ጊዜ ድረ-ገጾችን ደብቅ እና ስክሪንሻት መውሰድን አግድ።

source: Insecure Connection
am: ደህንነቱ ያልተጠበቀ ግንኙነት

source: Installed search engines
am: የተጫኑ የፍለጋ ፕሮግራሞች

source: <label>Someone could be trying to impersonate the site and continuing could be risky.</label> <br><br> <label>%1$s does not trust <b>%2$s</b> because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.</label>
am: <label>አንድ ሰው ድረ-ገፁን ለማስመሰል እየሞከረ ሊሆን ይችላል እና መቀጠል አደገኛ ሊሆን ይችላል።</label> <br><br> <label>%1$s <b>%2$s</b>ን አያምንም ምክንያቱም የእውቅና ማረጋገጫ ሰጪው ስለማይታወቅ፣ የእውቅና ማረጋገጫው በራሱ የተፈረመ ነው ወይም ሰርቨሩ ትክክለኛ መካከለኛ የእውቅና ማረጋገጫዎችን እየላከ አይደለም።</label>

source: Link available
am: ማገናኛ ይገኛል

source: Make %1$s default browser
am: አከናውን %1$s ነባሪ አሳሽ

source: Make %1$s your default to protect your data with every link you open.
am: በሚከፍቱት እያንዳንዱ አገናኝ ውሂብዎን ለመጠበቅ %1$s ነባሪ ያድርጉ።

source: Make privacy a habit
am: ግላዊነት የማድረግ ልማድ ያድርጉ

source: Manage sites
am: ድረ-ገፆችን ያስተዳድሩ

source: May result in missing icons or images
am: የአዶዎችን ወይም የምስሎችን መጥፋት ሊያስከትል ይችላል

source: More options button
am: ተጨማሪ አማራጮች አዝራር

source: Mozilla
am: ሞዚላ

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
am: ሞዚላ %1$s ለሁሉም ለማቅረብ እና ለማሻሻል የሚያስፈልገንን ብቻ ለመሰብሰብ ይጥራል

source: Navigate forward
am: ወደ ፊት አስስ

source: New custom URL added.
am: አዲስ ብጁ URL ታክሏል

source: New search engine added.
am: አዲስ የፍለጋ ፕሮግራም ታክሏል

source: NO
am: ይቅር

source: None of the apps on your device are able to open this link. You can leave %1$s to search %2$s for an app that can.
am: በመሣሪያዎ ላይ ካሉት መተግበሪያዎች ውስጥ አንዳቸውም ይህን አገናኝ መክፈት አይችሉም። የሚችል መተግበሪያ %2$s ለመፈለግ %1$sን ትተው መሄድ ይችላሉ።

source: Notifications let you erase your %1$s session with a tap. You don’t need to open the app or see what’s running in your browser.
am: ማሳወቂያዎች የ%1$s ክፍለ ጊዜዎን አንዴ በመንካት እንዲሰርዙ ያስችሉዎታል። መተግበሪያውን መክፈት ወይም በአሳሽዎ ውስጥ ምን እንደሚካሄድ ማየት አያስፈልግዎትም።

source: Number of trackers blocked
am: የታገዱ መከታተያዎች ብዛት

source: OFF for this site
am: ለዚህ ድረ-ገፅ ጠፍቷል

source: OK, got it!
am: እሺ ገባኝ!

source: ON for this site
am: ለዚህ ድረ-ገፅ በርቷል

source: Open a link in a new tab Long-press any link on a page
am: በአዲስ ትር ውስጥ አገናኝ ክፈት በገጽ ላይ ያለውን ማንኛውንም አገናኝ በረጅሙ ይጫኑ

source: Open every link in %1$s Set %1$s as default browser
am: እያንዳንዱን አገናኝ በ %1$s ክፈት %1$sን ነባሪ አሳሽ አድርግ

source: Open link in another app
am: አገናኙን በሌላ መተግበሪያ ውስጥ ይክፈቱ

source: Open Link in New Session
am: አገናኝ በአዲስ ክፍለ ጊዜ ክፈት

source: <p>%1$s puts you in control.</p> <p>Use it as a private browser: <ul> <li>Search and browse right in the app</li> <li>Block trackers (or update settings to allow trackers)</li> <li>Erase to delete cookies as well as search and browsing history</li> </ul> </p> <p>%1$s is produced by Mozilla. Our mission is to foster a healthy, open Internet.<br/> <a href="%2$s">Learn more</a></p>
am: <p>%1$s እርስዎን ውሣኔ ሰጪ ያደርግዎታል።</p> <p>እንደ የግል አሳሽ ይጠቀሙበት፡- <ul> <li>በመተግበሪያው ውስጥ ይፈልጉ እና ያስሱ</li> <li>መከታተያዎችን ያግዱ (ወይም መከታተያዎችን ለመፍቀድ ቅንብሮችን ያዘምኑ)</li> <li>ኩኪዎችን እንዲሁም የፍለጋ እና የአሰሳ ታሪክን ለማጥፋት ይደምስሱ</li> </ul> </p> <p>%1$s የሚመረተው በሞዚላ ነው። የእኛ ተልዕኮ ጤናማ እና ክፍት በይነመረብን ማዳበር ነው።<br/> <a href="%2$s">የበለጠ ለመረዳት</a></p>

source: Pages may load faster, but may also behave unexpectedly
am: ገፆች በፍጥነት ሊከፍቱ ይችላሉ፣ ግን ደግሞ ያልተጠበቀ ባህሪ ሊኖራቸው ይችላል

source: Paste or enter URL
am: ለጥፍ ወይም ግባ URL

source: Power up your privacy
am: ግላዊነትዎን ያስፉ

source: Privacy Notice.
am: የግላዊነት ማስታወቂያ።

source: Privacy & Security
am: ግላዊነት እና ደህንነት

source: Reload website
am: ድር ጣቢያ እንደገና ይጫኑ

source: Remote debugging via USB/Wi-Fi
am: በUSB/Wi-Fi በኩል የርቀት ማረም

source: Remove all websites
am: ሁሉንም ድረ-ገፆች አስወግድ

source: Remove custom URLs
am: ብጁ አስወግድ URLs

source: Remove from Shortcuts
am: ከአቋራጭ ላይ አስወድግ

source: Remove search engines
am: የፍለጋ ፕሮግራሞችን አስወግድ

source: Report Site Issue
am: የድረ-ገጹን ችግር አመልክት

source: Request desktop site
am: የዴስክቶፕ ድረ-ገፅን ይጠይቁ

source: Restore default search engines
am: ነባሪ የፍለጋ ፕሮግራሞችን ወደነበረበት መልስ

source: Return to your favorite sites in %1$s quickly. Just select \"Add to Home screen\" from the %1$s menu.
am: ወደ እርስዎ ተወዳጅ ጣቢያዎች ይመለሱ %1$s በፍጥነት:: በቀላሉ ይምረጡ \"ወደ መነሻ ማያ ገጽ አክል\" ከ ዘንድ %1$s ምናሌ::

source: Saved and shared images <b>will not be</b> deleted when you erase %1$s history
am: የተቀመጡ እና የተጋሩ ምስሎች የ%1$s ታሪክን ሲደመስሱ <b>አይጠፉም</b>

source: Search for %1$s
am: ፈልግ ስለ %1$s

source: Search in Focus
am: Focus ላይ ፈልግ

source: Search in Focus Beta
am: Focus Beta ላይ ፈልግ

source: Search in Focus Nightly
am: Focus Nightly ላይ ፈልግ

source: Searching for something different? Choose another default search engine in Settings.
am: የሆነ የተለየ ነገር በመፈለግ ላይ? በቅንብሮች ውስጥ ሌላ ነባሪ የፍለጋ ፕሮግራም ይምረጡ

source: Search in Klar
am: Klar ላይ ፈልግ

source: Search Privately
am: በግል ይፈልጉ

source: Search widget
am: የፍለጋ መግብር

source: Secure Connection
am: ደህንነቱ የተጠበቀ ግንኙነት

source: Security
am: ደህንነት

source: See fewer banners by automatically rejecting cookie requests, when possible.
am: በተቻለ መጠን የኩኪ ጥያቄዎችን በራስ-ሰር ውድቅ በማድረግ ያነሱ ባነሮችን ይመልከቱ።

source: Select your preferred engine:
am: የእርስዎን ተመራጭ ፍርግም ይምረጡ፡-

source: Send usage data
am: የአጠቃቀም ውሂብ ይላኩ

source: Server not found
am: አገልጋይ አልተገኘም

source: Set %1$s as your default browser and get the benefits of private browsing when you open webpages from other apps.
am: እንደ %1$s ነባሪ አሳሽዎ አድርገው ያቀናብሩ እና የድር ገጾች ከሌላ መተግበሪያዎች ሲከፍቱ የግል ማሰሻዎችን ጥቅሞች ያግኙ

source: Set default, autocomplete
am: ነባሪ አዘጋጅ፣ ራስ-አጠናቅቅ

source: settings
am: ቅንብሮች

source: Shortcut will open with Enhanced Tracking Protection disabled
am: አቋራጩ የተሻሻለ የክትትል ጥበቃ የሌለው ሆኖ ይከፈታል

source: Shortcut will open with Tracking Protection disabled
am: አቋራጭ ከተሰናከለ ከመከታተያ ጥበቃ ጋር ይከፈታል

source: Show search suggestions?
am: የፍለጋ ጥቆማዎችን አሳይ?

source: Site behaving unexpectedly? Try turning off Tracking Protection
am: ድረ-ገፁ ያልተጠበቀ ባህሪ አለው? የክትትል ጥበቃን በማጥፋት ይሞክሩ

source: Site Security
am: የድረ-ገፅ ደህንነት

source: Social
am: ማኅበራዊ

source: Some ads track site visits, even if you don’t click the ads
am: "ማስታወቂያዎች ባይጫኑ እንኳን አንዳንድ የማስታወቂያ መከታተያዎች የጣቢያ ጉብኝቶችን ይከታተላሉ "

source: Some search engines cannot show suggestions.
am: አንዳንድ የፍለጋ ፍርግሞች ጥቆማዎችን ማሳየት አይችሉም።

source: Sorry. We’re having a problem with this tab.
am: እናዝናለን። በዚህ ትር ላይ ችግር እያጋጠመን ነው።

source: Start your private browsing session, and we’ll block trackers and other bad stuff as you go.
am: የግል አሰሳ ክፍለ ጊዜህን ጀምር፣ እና ሲጠቀሙ መከታተያዎችን እና ሌሎች መጥፎ ነገሮችን እናግዳለን።

source: Stealth
am: ስውር

source: Stop loading website
am: ድር ጣቢያ መጫን አቁም

source: Switching Apps
am: መተግበሪያዎችን በመቀያየር ላይ

source: Switch to link in new tab immediately
am: ወደ አገናኝ አዲስ ትር ወዲያውኑ ቀይር

source: System default
am: የስርዓት ነባሪ

source: Tab Crashed
am: ትር ተበላሽቷል

source: Tab’s browsing history has been erased.
am: የትሩ የአሰሳ ታሪክ ተደምስሷል።

source: Tabs open: %1$s
am: ትሮች ተከፍተዋል: %1$s

source: Take private browsing to the next level. Block ads and other content that can track you across sites and bog down page load times.
am: የግል ፍለጋን ወደ ቀጣዩ ደረጃ ይወስዳል::በጣቢያዎች ውስጥ እርስዎን ሊከታተል የሚችል እና የገፅ ጭነት ጊዜዎችን ማደንዘዝ ማስታወቂያዎችን እና ሌላ ይዘትን አግድ

source: Tap here to trash it all — history, cookies, everything — and start fresh on a new tab.
am: ሁሉንም - ታሪክን፣ ኩኪዎችን፣ ሁሉንም ነገር ለማጥፋት እዚህ ነካ ያድርጉ እና በአዲስ ትር ላይ አዲስ ይጀምሩ።

source: Tap or clear this notification to securely erase your browsing history.
am: የአሰሳ ታሪክዎን ደህንነቱ በተጠበቀ መልኩ ለማጥፋት ይህን ማሳወቂያ መታ ያድርጉ ወይም ያጽዱ።

source: Tap or swipe this notification to securely erase your browsing history.
am: የአሰሳ ታሪክዎን ደህንነቱ በተጠበቀ መልኩ ለማጥፋት ይህን ማሳወቂያ መታ ያድርጉ ወይም ያንሸራትቱ።

source: These default settings offer strong protection. But it’s easy to tweak the settings to meet your specific needs.
am: እነዚህ ነባሪ ቅንጅቶች ጠንካራ ጥበቃ ይሰጣሉ። ግን ልዩ ፍላጎቶችዎን ለማሟላት ቅንብሮቹን ማስተካከል ቀላል ነው።

source: The site you requested does not support HTTPS
am: የጠየቁት ድረ-ገፅ HTTPSን አይደግፍም

source: This could be a problem with the server’s configuration, or it could be someone trying to impersonate the server. <br/><br/> If you’ve connected to this server successfully in the past, the error may be temporary.
am: ይህ የሰርቨር ውቅር ችግር ሊሆን ይችላል፣ ወይም ሰርቨሩን ለመምሰል የሚሞክር ሰው ሊሆን ይችላል። <br/><br/> ከዚህ ሰርቨር ጋር ከዚህ ቀደም በተሳካ ሁኔታ ከተገናኙ፤ ስህተቱ ጊዜያዊ ሊሆን ይችላል።

source: This site doesn’t support HTTPS
am: ይህ ድረ-ገፅ HTTPSን አይደግፍም

source: This site is currently not supported by Cookie Banner Reduction. Would you like to request our team review this website and add support in the future?
am: ይህ ድረ-ገጽ በአሁኑ ጊዜ በኩኪ ሰሌዳ ቅነሳ አይደገፍም። ቡድናችን ይህንን ድረ-ገጽ እንዲገመግም እና ለወደፊቱ ድጋፍ እንዲጨምር መጠየቅ ይፈልጋሉ?

source: To get suggestions, %1$s needs to send what you type in the address bar to the search engine.
am: ጥቆማዎችን ለማግኘት %1$s በአድራሻ አሞሌው ላይ የሚተይቡትን ወደ ፍለጋ ፍርግም መላክ አለበት።

source: Trackers and Scripts to Block
am: መከታተያዎች እና ስክሪፕቶች ለማገድ

source: Trackers blocked
am: ተከታታዮች ታግደዋል

source: Trackers blocked since %s
am: ከ%s ጀምሮ የታገዱ መከታተያዎች

source: Tracking, cookies, data choices
am: ክትትል፣ ኩኪዎች፣ የውሂብ ምርጫዎች

source: Turning this off may fix some site problems
am: ይህን ማጥፋት አንዳንድ የድረ-ገፅ ችግሮችን ሊፈታ ይችላል

source: Turn off tips on the start screen
am: በመነሻ ማያ ገጹ ላይ ጠቃሚ ምክሮችን አጥፋ

source: Turn off to fix some sites
am: አንዳንድ ድረ-ገፆችን ለመጠገን አጥፋ

source: Unlock using fingerprint if you’ve added Shortcuts or when a website is already open in %s.
am: አቋራጮችን ካከሉ ወይም አንድ ድረ-ገፅ በ%s ውስጥ ክፍት ከሆነ፤ የጣት አሻራ በመጠቀም ይክፈቱ።

source: URL already exists
am: ዩአርኤል አስቀድሞ አለ

source: URL Autocomplete
am: URL ራስ-አጠናቅቅ

source: URL to add
am: URL መጨመር

source: Used to collect, analyze and measure activities like tapping and scrolling
am: እንደ ማሸብለል እና መታ በማድረግ ያሉ እንቅስቃሴዎችን ለመተንተን እና ለመለካት ጥቅም ላይ የዋለ

source: Use fingerprint to unlock app
am: መተግበሪያን ለመክፈት የጣት አሻራ ይጠቀሙ

source: Verified by: %1$s
am: አረጋጋጭ: %1$s

source: Web Content
am: የድር ይዘት

source: Website loaded
am: ድር ጣቢያ ተጭኗል

source: We clear your history when you close the app for extra privacy.
am: ለተጨማሪ ግላዊነት መተግበሪያውን ሲዘጉ ታሪክዎን እናጸዳለን።

source: Welcome to %1$s
am: እንኳን ወደ %1$s በደህና መጡ

source: We’ll leave you to your private browsing, but get a quicker start next time with the %1$s widget on your Home screen.
am: እርስዎን ከግል አሰሳዎ ጋር እንተውዎታለን፣ ነገር-ግን በሚቀጥለው ጊዜ በመነሻ ማያዎ ላይ ባለው %1$s መግብር በፍጥነት ይጀምሩ።

source: What’s New
am: አዲስ ምን አለ

source: Widget added to home screen
am: መግብር ወደ መነሻ ማያ ገጽ ታክሏል

source: Would you like to block cookies?
am: ኩኪዎችን ማገድ ይፈልጋሉ?

source: YES
am: አዎ

source: Yes please
am: አዎ እባክዎ

source: You are not granted any rights or licenses to the trademarks of the Mozilla Foundation or any party, including the Mozilla, Firefox or %1$s names or logos. Additional information may be found <a href="%2$s">here</a>.
am: የሞዚላ፣ ፋየርፎክስ ወይም %1$s ስሞችን ወይም ዓርማዎችን ጨምሮ የሞዚላ ፋውንዴሽን ወይም የማንኛውም አካል የንግድ ምልክቶች ምንም ዓይነት መብት ወይም ፍቃድ አልተሰጠዎትም። ተጨማሪ መረጃ <a href="%2$s">እዚህ</a> ሊገኝ ይችላል።

source: You can leave %1$s to open this link in %2$s.
am: መሄድ ይችላሉ %1$s ይህንን አገናኝ በ ውስጥ ለመክፈት %2$s

source: You can use your fingerprint to continue your current app session.
am: የአሁኑን የመተግበሪያ ክፍለ ጊዜዎን ለመቀጠል የጣት አሻራዎን መጠቀም ይችላሉ።

source: You have disabled content blocking for these websites.
am: ለእነዚህ ድረ-ገጾች የሚከለክል የይዘት እገዳን አንስተዋል።

source: Your autocomplete list:
am: የእርስዎ ራስ-አጠናቅቅ ዝርዝር፡-

source: Your browsing history has been erased.
am: የአሰሳ ታሪክዎ ተደምስሷል

source: You’re protected!
am: እርስዎ ጥበቃ ይደረግልዎታል!

source: Your Rights
am: የእርስዎ መብቶች

source: Your search, your way
am: የእርስዎ ፍለጋ, የእርስዎ መንገድ

source: 1. Go to the search engine homepage.
am: 1. ወደ የፍለጋ ፕሮግራም መነሻ ገጽ ይሂዱ

source: 2. Long press the search engine’s search field.
am: 2. የፍለጋ ፕሮግራም የፍለጋ መስኩን በረጅሙ ይጫኑ

source: 2. Tap into the search engine’s search field.
am: 2. ወደ የፍለጋ ፕሮግራም የፍለጋ መስክ ውስጥ መታ ያድርጉ

source: 3. Tap %1$s
am: 3. መታ ያድርጉ %1$s

source: 3. Tap the magnifying glass icon above the keyboard to add the search engine.
am: 3. የፍለጋ ፕሮግራሙን ለማከል ከቁልፍ ሰሌዳው በላይ የማጉሊያውን አዶ ጠቅ ያድርጉ

source: 4. If you don’t see %1$s, try manually adding a search engine.
am: ካልታዩት %1$s የፍለጋ ማሸን እራስዎ ማከል ይሞክሩ

source: 4. If you don’t see the magnifying glass, try manually adding a search engine.
am: 4. የማጉሊያውን መነፅር ካላዩት የመፈለጊያ ሞተር እራስዎ በማከል ይቀይሩት

source: Autocomplete
am: ራስ-አጠናቅቅ

source: Block images
am: ምስሎችን አግድ

source: Copy image address
am: የምስል አድራሻ ቅዳ

source: Copy link address
am: የአገናኝ አድራሻ ቅዳ

source: Custom URL
am: ብጁ URL

source: Custom URLs
am: ብጁ URLs

source: Default search
am: ነባሪ ፍለጋ

source: Default URL List
am: ነባሪ URL ዝርዝር

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
am: የወረዱ ፋይሎች <b> አይሰርዝም </b> ሲደመስሱ %1$s ታሪክ

source: Download File
am: ሰነድ አውርድ

source: Enable
am: አንቃ

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
am: ሊኖራቸው የሚችል ያንቁ %1$s ራስ-አጠናቅቅ ተጠናቋል 450 ታዋቂ URLs በአድራሻ አሞሌ ውስጥ::

source: Expand
am: ዘርጋ

source: Hide webpages when switching apps
am: መተግበሪያዎችን በሚቀይሩበት ጊዜ ድረ-ገጾችን ደብቅ

source: Manually add
am: በእጅ ያክሉ

source: Name to display
am: ለማሳየት ይሰይሙ

source: Oops
am: ውይ

source: Open tab
am: ትር ክፈቱ

source: Open with…
am: ይክፈቱ በ…

source: Open with %1$s
am: ይክፈቱ በ %1$s

source: Paste or enter search string. If necessary, replace search term with: %s.
am: ለጥፍ ወይም የፍለጋ ሕብረቁምፊን ያስገቡ:: አስፈላጊ ከሆነ የፍለጋ ቃላትን ይተኩ በ: %s

source: Problem loading page
am: ገጽን በመጫን ላይ ችግር

source: Return to your favorite sites in %1$s quickly. Just select "Add to Home screen" from the %1$s menu.
am: ወደ እርስዎ ተወዳጅ ጣቢያዎች ይመለሱ %1$s በፍጥነት:: በቀላሉ ይምረጡ "ወደ መነሻ ማያ ገጽ አክል" ከ ዘንድ %1$s ምናሌ::

source: Saved and shared images <b>will not be deleted</b> when you erase %1$s history.
am: የተቀመጡ እና የተጋሩ ምስሎች<b>አይሰርዝም</b>ሲደመስሱ%1$sታሪክ

source: Secure connection failed
am: ደህንነቱ የተጠበቀ ግንኙነት አልተሳካም

source: Tap the magnifying glass icon above the keyboard to add this search engine.
am: ይህን የፍለጋ ፕሮግራም ለማከል ከቁልፍ ሰሌዳው በላይ የማጉሊያውን አዶ ጠቅ ያድርጉ

source: The address wasn’t understood
am: አድራሻው አልተረዳም ነበር

source: The connection timed out
am: ግንኙነቱ ጊዜው አልፎበታል

source: <ul> <li>Check the address for typing errors such as <strong>ww</strong>.example.com instead of <strong>www</strong>.example.com</li> <li>If you are unable to load any pages, check your device’s data or Wi-Fi connection.</li> </ul>
am: <ul> <li>ስህተቶችን ለመተየብ አድራሻውን ይመልከቱ ለምሳሌ <strong>ww</strong>.example.com ከሱ ይልቅ <strong>www</strong>.example.com</li> <li>ማንኛውም ገጾችን መጫን የማይችሉ ከሆነ የመሣሪያዎን ውሂብ ወይም የ Wi-Fi ግንኙነትን ያረጋግጡ</li> </ul>

source: <ul> <li>The site could be temporarily unavailable or too busy. Try again in a few moments.</li> <li>If you are unable to load any pages, check your mobile device’s data or Wi-Fi connection.</li> </ul>
am: <ul> <li>ያለው ጣቢያ ለጊዜው አይገኝም ወይም በጣም ስራ ሊሆን ይችላል:: ከጥቂት ደቂቃዎች በኋላ እንደገና ይሞክሩ</li> <li>ማንኛውም ገጾችን መጫን የማይችሉ ከሆነ የተንቀሳቃሽ መሣሪያዎ ውሂብ ወይም የ Wi-Fi ግንኙነትን ይፈትሹ</li> </ul>

source: <ul> <li>This problem can sometimes be caused by disabling or refusing to accept cookies.</li> </ul>
am: <ul> <li>ይህ ችግር አንዳንድ ጊዜ ኩኪዎችን ለመቀበል በማሰናከል ወይም በመቃወም ሊከሰት ይችላል</li> </ul>

source: <ul> <li>You might need to install other software to open this address.</li> </ul>
am: <ul> <li>ይህን አድራሻ ለመክፈት ሌላ ሶፍትዌር መጫን ሊያስፈልግዎ ይችላል</li> </ul>

source: We can’t load this page for some reason.
am: ይህን ገጽ በሆነ ምክንያት ልንጭነውም አንችልም

source: What's New
am: አዲስ ምን አለ

source: %1$@ wants to open %2$@
am: %1$@ %2$@ን መክፈት ይፈልጋል

source: About %@
am: ስለ %@

source: Add Another Search Engine
am: ሌላ የፍለጋ ፍርግም አክል

source: Add a %@ shortcut to your Home screen. After adding the widget, touch and hold to edit it and select a different shortcut.
am: በመነሻ ማያዎ ላይ የ%@ አቋራጭ ያክሉ። መግብርን ካከሉ በኋላ ለማርትዕ ይንኩ እና ይያዙ እና የተለየ አቋራጭ ይምረጡ።

source: Add a %@ Widget
am: %@ መግብር አክል

source: + Add Custom URL
am: + ብጁ ዩአርኤል አክል

source: Add Custom URL
am: ብጁ ዩአርኤል አክል

source: Added to Shortcuts
am: ወደ አቋራጮች ታክሏል

source: Add Search Engine
am: የፍለጋ ፍርግም አክል

source: Add Siri shortcut
am: Siri አቋራጭ ያክሉ

source: Add to Siri
am: ወደ Siri ያክሉ

source: Agree and Continue
am: እስማማለሁ እና ቀጥል

source: An error occured while adding the pass to Wallet. Please try again later.
am: ማለፊያውን ወደ ዋሌት በማከል ላይ ስህተት ተፈጥሯል። እባክዎ ቆየት ብለው ይሞክሩ።

source: Authenticate to return to %@
am: ወደ %@ ለመመለስ ያረጋግጡ

source: Automatically Send Crash Reports
am: የብልሽት ሪፖርቶችን በራስ-ሰር ላክ

source: Block Content Trackers
am: የይዘት መከታተያዎችን አግድ

source: Blocking other content trackers may break some videos and web pages.
am: ሌሎች የይዘት መከታተያዎችን ማገድ አንዳንድ ቪዲዮዎችን እና ድረ-ገጾችን ሊያስተጓጉል ይችላል።

source: Block trackers for improved privacy
am: ለተሻሻለ ግላዊነት መከታተያዎችን አግድ

source: Block trackers (or update settings to allow trackers)
am: መከታተያዎችን ያግዱ (ወይም መከታተያዎችን ለመፍቀድ ቅንብሮችን ያዘምኑ)

source: Block web fonts
am: የድር ቅርጸ-ቁምፊዎችን አግድ

source: Block web fonts to reduce page size
am: የገጽ መጠንን ለመቀነስ የድር ቅርጸ ቁምፊዎችን አግድ

source: Browse like no one’s watching.
am: ማንም እንደማይመለከት አስስ።

source: By continuing, you agree to %@.
am: በመቀጠል፣ በ%@ ተስማምተዋል።

source: Clear your entire browsing session history, passwords, cookies anytime with a single tap.
am: በአንድ ጊዜ መታ በማድረግ ሁሉንም የአሰሳ ክፍለ ጊዜ ታሪክዎን ፣ የይለፍ ቃሎችን ፣ ኩኪዎችን በማንኛውም ጊዜ ያጽዱ።

source: Configure settings so you can decide how much or how little you share.
am: ምን ያህል ብዙ ወይም ትንሽ እንደሚያጋሩ ለመወሰን ቅንብሮችን ያዋቅሩ።

source: Content blocking and tracking protection from Mozilla
am: ከሞዚላ የይዘት እገዳ እና የክትትል ጥበቃ

source: Copy Address
am: አድራሻ ቅዳ

source: Create shortcuts to the sites you visit most:
am: በብዛት ወደሚጎበኟቸው ድረ-ገፆችአቋራጮችን ይፍጠሩ፡-

source: Daily Usage Ping
am: ዕለታዊ አጠቃቀም ማሳወቂያ

source: Enable %@
am: %@ን አንቃ

source: Enable to have %@ autocomplete over 450 popular URLs in the address bar.
am: በአድራሻ አሞሌው ውስጥ ከ450 በላይ ታዋቂ ዩአርኤሎችን %@ በራስ ሰር እንዲያጠናቅቁ አስጀምር።

source: Enable to have %@ autocomplete your favorite URLs.
am: የሚወዷቸውን ዩአርኤሎች %@ በራስ ሰር እንዲያጠናቅቅ ያንቁ።

source: ERASE
am: ደምስስ

source: Erase browsing session
am: የአሰሳ ክፍለ ጊዜን ደምስስ

source: Erase & Open
am: ደምስስ እና ክፈት

source: Erase to delete cookies as well as search and browsing history
am: ኩኪዎችን ለመሰረዝ እንዲሁም የፍለጋ እና የአሰሳ ታሪክን ያጥፉ

source: Erase your browsing history, passwords, cookies, and prevent unwanted ads from following you in a simple click!
am: የአሰሳ ታሪክዎን፣ የይለፍ ቃሎችዎን፣ ኩኪዎችዎን ያጥፉ እና አላስፈላጊ ማስታወቂያዎችን በቀላል ጠቅታ እንዳትከተልሉዎ ያግዱ!

source: Example: searchengine.example.com/search/?q=%s
am: ምሳሌ፡- searchengine.example.com/search/?q=%s

source: Face ID can unlock %@ if a URL is already open in the app
am: ዩአርኤል አስቀድሞ በመተግበሪያው ውስጥ ከተከፈተ፤ የፊት መታወቂያ %@ን መክፈት ይችላል

source: Failed to Add Pass
am: ማለፊያ ማከል አልተሳካም

source: Fast. Private. No Distractions.
am: ፈጣን። የግል። ትኩረትን የሚከፋፍሉ ነገሮች የሌለው።

source: Find in page: %@
am: በገፅ ውስጥ ፈልግ:- %@

source: Find in page done
am: የገፅ ውስጥ ፍለጋው ተጠናቋል

source: Find next in page
am: በገፅ ውስጥ ቀጣዩን ይፈልጉ

source: Find previous in page
am: በገፅ ውስጥ የቀደመውን ይፈልጉ

source: Firefox cares about your privacy. Read more in %@.
am: Firefox የእርስዎን ግላዊነት ያስባል። በ%@ ውስጥ የበለጠ ያንብቡ።

source: Get Search Suggestions
am: የፍለጋ ጥቆማዎችን ያግኙ

source: Get Started
am: ይጀምሩ

source: Go to Settings to manage specific privacy & security options.
am: የተወሰኑ የግላዊነት እና የደህንነት አማራጮችን ለማስተዳደር ወደ ቅንብሮች ይሂዱ።

source: INSTALLED SEARCH ENGINES
am: የተጫኑ የፍለጋ ፍርግሞች

source: %@ is a dedicated privacy browser with tracking protection and content blocking.
am: %@ የመከታተያ ጥበቃ እና የይዘት እገዳ ያለው የግላዊነት አሳሽ ነው።

source: %@ is not enabled.
am: %@ አልነቃም።

source: %@ isn’t like other browsers
am: %@ እንደ ሌሎች አሳሾች አይደለም

source: %@ is produced by Mozilla. Our mission is to foster a healthy, open Internet.
am: %@ በሞዚላ የለማ ነው። የእኛ ተልዕኮ ጤናማ እና ክፍት በይነመረብን ማሳደግ ነው።

source: Learn more.
am: ተጨማሪ ይወቁ።

source: Licenses
am: ፈቃዶች

source: Lock %@ when a site is open:
am: ድረ-ገፅ ሲከፈት %@ን ይቆልፉ፡-

source: Long press on the Home screen until the icons start to jiggle.
am: አዶዎቹ መንቀጥቀጥ እስኪጀምሩ ድረስ በመነሻ ማያ ገጹ ላይ በረጅሙ ይጫኑ።

source: Make %@ your default to protect your data with every link you open.
am: በሚከፍቱት እያንዳንዱ አገናኝ ውሂብዎን ለመጠበቅ %@ ነባሪ ያድርጉ።

source: Manage Sites
am: ድረ-ገፆችን ያስተዳድሩ

source: %@ may install and run studies from time to time.
am: %@ ከጊዜ ወደ ጊዜ ጥናቶችን ሊጭን እና ሊያካሂድ ይችላል።

source: More than just incognito
am: ማንነትን ከማያሳውቅ በላይ

source: MOZILLA
am: ሞዚላ

source: Mozilla strives to collect only what we need to provide and improve %@ for everyone.
am: ሞዚላ %@ን ለሁሉም ሰው ለማቅረብ እና ለማሻሻል የሚያስፈልገንን ብቻ ለመሰብሰብ ይጥራል።

source: My Sites
am: የእኔ ድረ-ገፆች

source: New Custom URL added.
am: አዲስ ብጁ ዩአርኤል ታክሏል።

source: New Search Engine Added.
am: አዲስ የፍለጋ ፍርግም ታክሏል።

source: New Session
am: አዲስ ክፍለ ጊዜ

source: No Custom URLs to display
am: የሚታዩ ምንም ብጁ ዩአርኤሎች የሉም

source: Ok
am: እሺ

source: OK, Got It!
am: እሺ፣ ገባኝ!

source: Open device settings
am: የመሣሪያ ቅንብሮችን ይክፈቱ

source: Open Favorite Site
am: ተወዳጅ ድረ-ገፅ ክፈት
